uhnp/src/Reports/РасшифровкаРасхожденийВГО/РасшифровкаРасхожденийВГО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Report>
  <name>РасшифровкаРасхожденийВГО</name>
</mdclass:Report>

uhnp/src/Enums/СтороныСверкиВГО/СтороныСверкиВГО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтороныСверкиВГО</name>
  <enumValues>
    <name>Кредитор</name>
    <comment>Организация-кредитор (отправитель)</comment>
  </enumValues>
  <enumValues>
    <name>Дебитор</name>
    <comment>Организация-дебитор (получатель)</comment>
  </enumValues>
</mdclass:Enum>

uhnp/src/Reports/РасшифровкаРасхожденийВГО/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	ПодоготовитьКомпоновщикПоРасшифровке();
	
	НастройкиСКД = КомпоновщикНастроек.ПолучитьНастройки();
	
	ТекущиеПараметры = ПолучитьОтбор(НастройкиСКД);

	ДопПараметры = Неопределено;
	ДопПоляОтчета = Неопределено;
	
	СхемаКомпоновкиДанных.НаборыДанных.НаборДанных1.Запрос 
		= СверкаВГОУХ.ВернутьТекстЗапросаДляРасшифровки(ТекущиеПараметры, ДопПараметры, ДопПоляОтчета);
		
	Если Не ЗначениеЗаполнено(СхемаКомпоновкиДанных.НаборыДанных.НаборДанных1.Запрос) Тогда
		ТекстСообщения = НСтр("ru = 'Не удалось найти актуальные разделы сверки и источники данных сверки. Проверьте шаблон сверки ВГО.'");
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, ЭтотОбъект);
	КонецЕсли;	
	
	КомпоновщикНастроек.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(СхемаКомпоновкиДанных));
	
		
	ОтчетСсылка = ОбщегоНазначения.ИдентификаторОбъектаМетаданных(ТипЗнч(ЭтотОбъект));
	КонтекстФормы = Новый Структура("Элементы, НастройкиОтчета, ФормаПараметры", 
					Новый Массив, Новый Структура("ОтчетСсылка", ОтчетСсылка), Новый Структура("Отбор", Новый Массив));
	ОтчетыПереопределяемый.ПередЗагрузкойВариантаНаСервере(КонтекстФормы, КомпоновщикНастроек.Настройки);
	
	Если ДопПараметры <> Неопределено Тогда
		Для каждого ДопПараметр Из ДопПараметры Цикл
			Результат = ТиповыеОтчетыУХ.УстановитьПараметр(КомпоновщикНастроек.Настройки, ДопПараметр.Ключ, ДопПараметр.Значение);
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПодоготовитьКомпоновщикПоРасшифровке()
	
	НастройкиСКД = КомпоновщикНастроек.Настройки;
	
	Если Не НастройкиСКД.ДополнительныеСвойства.Свойство("КлючВарианта") Тогда
		Возврат;
	ИначеЕсли НастройкиСКД.ДополнительныеСвойства.КлючВарианта <> "Контрагент" Тогда
		Возврат;
	ИначеЕсли НастройкиСКД.ДополнительныеСвойства.Свойство("Заменить") И (НастройкиСКД.ДополнительныеСвойства.Заменить = Ложь) Тогда
		Возврат;
	КонецЕсли;
	
	НастройкиСКД.ДополнительныеСвойства.Вставить("Заменить", Ложь);
	
	КомпоновщикПН = КомпоновщикНастроек.ПользовательскиеНастройки;
	
	ОтборОрганизация = ОбщегоНазначенияКлиентСервер.НайтиЭлементыИГруппыОтбора(НастройкиСКД.Отбор, "Организация").Получить(0);
	ОтборКонтрагент = ОбщегоНазначенияКлиентСервер.НайтиЭлементыИГруппыОтбора(НастройкиСКД.Отбор, "Контрагент").Получить(0);
	ОтборСторонаСверки = ОбщегоНазначенияКлиентСервер.НайтиЭлементыИГруппыОтбора(НастройкиСКД.Отбор, "СторонаСверки").Получить(0);
	
	ОрганизацияПН = ТиповыеОтчетыУХ.ПолучитьПользовательскуюНастройку(ОтборОрганизация, КомпоновщикПН);
	КонтрагентПН = ТиповыеОтчетыУХ.ПолучитьПользовательскуюНастройку(ОтборКонтрагент, КомпоновщикПН);
	
	Организация = ОрганизацияПН.ПравоеЗначение;
	Контрагент = КонтрагентПН.ПравоеЗначение;
	
	ОрганизацияПН.ПравоеЗначение = Контрагент;
	КонтрагентПН.ПравоеЗначение = Организация;
	
	СторонаСверкиПН = ТиповыеОтчетыУХ.ПолучитьПользовательскуюНастройку(ОтборСторонаСверки, КомпоновщикПН);
	Если (СторонаСверкиПН <> Неопределено) И СторонаСверкиПН.Использование Тогда
		
		Дебитор = Перечисления.СтороныСверкиВГО.Дебитор;
		Кредитор = Перечисления.СтороныСверкиВГО.Кредитор;
		
		СторонаСверкиПН.ПравоеЗначение = ?(СторонаСверкиПН.ПравоеЗначение = Дебитор, Кредитор, Дебитор);
		
	КонецЕсли;
	
КонецПроцедуры

Функция ПолучитьОтбор(НастройкиСКД)
	
	Отбор = Новый Структура;
	
	Для каждого Элемент Из НастройкиСКД.Отбор.Элементы Цикл
		Если ТипЗнч(Элемент) = Тип("ЭлементОтбораКомпоновкиДанных") Тогда
			Если Элемент.Использование Тогда
				Отбор.Вставить(Элемент.ЛевоеЗначение, Элемент.ПравоеЗначение);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Для каждого Элемент Из НастройкиСКД.ПараметрыДанных.Элементы Цикл
		Если Элемент.Использование Тогда
			Отбор.Вставить(Элемент.Параметр, Элемент.Значение);
		КонецЕсли;
	КонецЦикла;
	
	Возврат Отбор;

КонецФункции

#КонецЕсли

Если ИдентификацияПродуктаУХКлиентСервер.ЭтоЕХ() Тогда
	СхемаКомпоновкиДанных.НаборыДанных[0].Запрос = СтрЗаменить(СхемаКомпоновкиДанных.НаборыДанных[0].Запрос, "Владелец", "Контрагент");
КонецЕсли;
